---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFilterType.EndsWith
enum: Autodesk.Revit.DB.ScheduleFilterType
source: html/9b696f55-de40-8739-8cfb-decd51995cff.htm
---
# Autodesk.Revit.DB.ScheduleFilterType.EndsWith

For a string field, the field value ends with specified string.